InformationRegisters/АдресацияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>АдресацияЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Comment>Флаг активности пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Comment>Местонахождение группы или подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьИБ</Name>
					<Comment>Учетная запись информационной базы с которой олицетворен пользователь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияПараметр</Name>
					<Comment>Параметр аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Comment>Тип аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>96</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Comment>Используется в бизнес-процессе "Обратная связь лояльности" для постановки и отбора задач</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриОткрытииПоказыватьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
					<Comment>Полномочия пользователя</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Доступные подразделения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Доступ к иерархии подразделения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЦелевыеТочки</Name>
					<Comment>Целевые точки, которые доступны дополнительно, не зависимо от достуных подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеОбщиеОчереди</Name>
					<Comment>Очереди, не привязанные к целевым точкам, но включающие агентов целевых звонков (общие очереди)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПроцессыСервер/Ext/Module.bsl
Функция НазначьИсполнителя(Роль, Подразделение, ДопРеквизитАдресации = "") Экспорт
	//Возвращает пользователя-исполнителя по роли и подразделению
		
	ИсполнительПоУмолчанию = Справочники.Пользователи.НайтиПоНаименованию("Лодякова Татьяна Викторовна");
	
	Доступно = 		ТипЗнч(Роль)			 = Тип("СправочникСсылка.Роли")
				И	ТипЗнч(Подразделение) 	= Тип("СправочникСсылка.Предприятие") ;

	Если Не Доступно Тогда
		Возврат ИсполнительПоУмолчанию;	
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Исполнитель ИЗ РегистрСведений.АдресацияЗадач ГДЕ Роль = &Роль И Подразделение = &Подразделение И ДопРеквизитАдресации = &ДопРеквизитАдресации");
	Запрос.УстановитьПараметр("Роль", 			Роль);
	Запрос.УстановитьПараметр("Подразделение",	Подразделение);
	Запрос.УстановитьПараметр("ДопРеквизитАдресации",  ДопРеквизитАдресации);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ИсполнительПоУмолчанию;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	
	Исполнитель = Выборка.Исполнитель;
	
	Если Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		Исполнитель = ИсполнительПоУмолчанию;
	КонецЕсли;
	
	Возврат Исполнитель;
	
КонецФункции

Функция ПриОткрытииПоказыватьЗадачи(Пользователь) Экспорт
	// Возвращает свойство пользователя показывать при открытии список задач
	// Вызов из: МодульУправляемогоПриложения.ПриНачалеРаботыСистемы()

	Доступно = 		ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи")
				И 	ЗначениеЗаполнено(Пользователь);
	Если Не Доступно Тогда
		Возврат Ложь
	КонецЕсли;
	
	Возврат Пользователь.ПриОткрытииПоказыватьЗадачи	
КонецФункции

#Область Задачи

Функция ЗадачаЗаписать(Задача, Комментарий="") Экспорт
	
	Доступно = 		ТипЗнч(Задача) = Тип("ЗадачаСсылка.ЗадачаОбратнаяСвязь")
				И 	ЗначениеЗаполнено(Задача);
	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Зад = Задача.ПолучитьОбъект();
	Зад.Комментарий = Комментарий;
	
	Попытка
		Зад.Записать();
	Исключение  
		ЗаписьЖурналаРегистрации("ЗадачаЗаписать()", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("Задача = %1; Комментарий = %2", Задача, Комментарий), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
  КонецФункции

Функция ЗадачаВыполнить(Задача, ИсполнительФакт = Неопределено, ДатаВыполнения = '00010101', Комментарий = "", ОценкаВыполненияПредшествующейЗадачи = 0) Экспорт
	//Параметр ОценкаВыполненияПредшествующейЗадачи используется для задач проверки	

	
	ЗначениеПоУмолчанию = Ложь;
	
	Доступно = 		ТипЗнч(Задача) = Тип("ЗадачаСсылка.ЗадачаОбратнаяСвязь")
				И 	ЗначениеЗаполнено(Задача);	
	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Зад = Задача.ПолучитьОбъект();
	Зад.Комментарий 							= Комментарий;
	Зад.ИсполнительФакт 						= ПараметрыСеанса.ТекущийПользователь;
	Зад.ОценкаВыполненияПредшествующейЗадачи 	= ОценкаВыполненияПредшествующейЗадачи;    	
	Зад.ДатаВыполнения 							= ?(ДатаВыполнения = '00010101', ТекущаяДата(), ДатаВыполнения);
	Зад.ИсполнительФакт 						= ?(ИсполнительФакт = Неопределено, ПараметрыСеанса.ТекущийПользователь, ИсполнительФакт); 
		
	Попытка
		Зад.ВыполнитьЗадачу();
	Исключение
		ОбслуживаниеСервер.ЗарегистрироватьСобытие("ЗадачаВыполнить()", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("Задача = %1, ИсполнительФакт = %2, ДатаВыполнения = %3, Комментарий = %4", Задача, ИсполнительФакт, ДатаВыполнения, Комментарий), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции
#КонецОбласти
